#include <iostream>

using namespace std;

int main()
{
	// for (1. 초기화식	; 2. 조건식	; 4. 증감식	)
	// {
	// 		3. 코드 블럭
	// }

	/*for (int i = 0; i < 3; ++i)
	{
		cout << "hello world" << endl;
	}*/

	// int		i = 999;
	// 
	// for (int i = 0; i < 3; ++i)
	// {
	// 	cout << i << endl;
	// }
	// 
	// cout << i << endl;

	/////////////////////////////////////////////////////////
	// 2중 for문

	for (int i = 0; i < 2; ++i)
	{
		cout << 1 << endl;

		for (int j = 0; j < 3; ++j)
		{
			cout << 2 << endl;
		}

		cout << 3 << endl;
	}

	return 0;
}

/*

1. 2중 for문을 이용하여 구구단 2~9단 출력
2. 2중 for문을 이용하여 입력한 단과 곱만큼만 출력
ex) 5단, 4곱

2 * 1 = 2
2 * 2 = 2
2 * 3 = 2
2 * 4 = 2

3 * 1 = 2
3 * 2 = 2
3 * 3 = 2
3 * 4 = 2

4 * 1 = 2
4 * 2 = 2
4 * 3 = 2
4 * 4 = 2

5 * 1 = 2
5 * 2 = 2
5 * 3 = 2
5 * 4 = 2

3. 다음과 같이 2중 for문을 이용하여 그림을 완성하시오

*
**
***
****
*****

*****
****
***
**
*

    *
   **
  ***
 ****
*****

*****
 ****
  ***
   **
    *

*/