#include <iostream>

using namespace std;

int main()
{
	// F9: 중단점 설정 / 삭제
	// F10 : 프로시저 단위 실행, 해당 줄의 다음 줄 실행
	// F11 : 한 단계씩 실행, 함수를 만나면 함수 안으로 들어감
	// Shift + F11 : 프로시저 나가기, 함수 밖으로 나가서 실행
	// Shift + F5 : 디버깅 모드 중단

	// Ctrl + F9: 중단점 해제
	// Ctrl + Shift + F9 : 모든 중단점 삭제
	// Alt + F9 : 중단점 창 띄우기
	// Ctrl + F10 : 커서까지 실행
	// Ctrl + K, B : 함수 중단점
	// Shift + Alt + F9, T : 임시 중단점

	// int		iData(10);
	// iData = 20;
	// cout << iData << endl;

	////////////////////////////////////////////////////////////
	// 배열 : 같은 자료형의 데이터를 연속적인 메모리 공간에 할당하는 문법

	// int	iArray[3];		// int 형 배열을 선언하다.
							// int형 변수 세 개를 동시에 선언

//	int		iArray		[3] = { 10, 20. 30 };	// int 형 배열을 선언과 동시에 초기화
// 자료형 	배열의 이름	[개수]

	

	return 0;
}